tutorials/oodles/pitzDaily/system/fvSolution
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          fvSolution;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p PCG
    {
        preconditioner
        {
            type        DIC;
        }

        minIter          0;
        maxIter          2000;
        tolerance        1e-06;
        relTol           0.05;
    };
    pFinal PCG
    {
        preconditioner
        {
            type        DIC;
        }

        minIter          0;
        maxIter          2000;
        tolerance        1e-06;
        relTol           0;
    };
    U PBiCG
    {
        preconditioner
        {
            type        DILU;
        }

        minIter          0;
        maxIter          500;
        tolerance        1e-05;
        relTol           0;
    };
    k PBiCG
    {
        preconditioner
        {
            type        DILU;
        }

        minIter          0;
        maxIter          500;
        tolerance        1e-05;
        relTol           0;
    };
    B PBiCG
    {
        preconditioner
        {
            type        DILU;
        }

        minIter          0;
        maxIter          500;
        tolerance        1e-05;
        relTol           0;
    };
    nuTilda PBiCG
    {
        preconditioner
        {
            type        DILU;
        }

        minIter          0;
        maxIter          500;
        tolerance        1e-05;
        relTol           0;
    };
}


PISO
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
}


// Relaxation factors are used for transient SIMPLE
relaxationFactors
{
    p               0.5;
    U               0.8;
}


// ************************************************************************* //
